{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2025/07/14/hello-world/"},{"title":"second","text":"Sherlock Holmes介绍Sherlock Holmes 是由英国作家亚瑟·柯南·道尔创作的虚构侦探角色。他以极高的智力、出色的观察力和推理能力，解决了无数复杂的案件，成为侦探文学中的经典人物。Holmes 的形象已成为侦探类故事的代名词。 主要人物Sherlock Holmes 特点：敏锐的观察力，出色的推理能力，冷静的头脑。 技能：擅长从微小的细节中推测出案件真相，熟知化学、解剖学、犯罪心理学等学科。 Dr. John Watson 特点：Holmes 的忠实伙伴与朋友，通常是故事的叙述者。 技能：医生，军事背景，具有基本的侦探技巧和极高的忠诚度。 经典案件《巴斯克维尔的猎犬》这是 Sherlock Holmes 系列中的一个经典案件，讲述了一个关于家族诅咒和神秘猎犬的故事。Holmes 通过理性推理和对细节的关注揭开了真相。 《四签名》此案件涉及一系列神秘的死亡与失踪案件，Holmes 通过与Watson 的紧密合作，揭示了复杂的犯罪背后隐藏的秘密。 名言 “当你排除了不可能的，剩下的无论多么不可能，都是事实。” “我不相信没有合理解释的事情。” 结语Sherlock Holmes 的故事不仅仅是侦探小说，它们蕴含着深刻的逻辑推理和对人性的深刻洞察，成为了世界文学的经典之一。 这是一个简单的 Sherlock 主题页面，包含了基础的内容、人物介绍、经典案件和名言。你可以在这个基础上根据自己的需要扩展更多的内容。","link":"/2025/07/30/second/"},{"title":"my first bolg","text":"灰原哀的博客 🌸“真相只有一个，而我，只想安静地观察世界。” 🧬 博主简介 名字：灰原哀（Haibara Ai）真名：宫野志保（Shiho Miyano）原组织代号：雪莉（Sherry）身份：天才少女科学家、APTX4869开发者当前状态：被缩小为小学生，假扮帝丹小学学生 热爱科研与冷静思考，曾是黑衣组织成员，后因背叛组织服药变小。性格沉静理智，拥有非凡的科学头脑与极高的洞察力。 📚 博客内容本博客主要分享以下几个方面的内容： 🔬 科学与推理 化学实验 &amp; AP开发笔记 犯罪心理学分析 柯南案件分析与复盘 💡 思维与哲学 对人性的观察与思考 存在主义、宿命与选择 组织中的权力结构探析 📝 日常随笔 帝丹小学生活碎片 与少年侦探团的趣事 与工藤新一的若干“无言”交锋 🧊 博主格言 ❝ 不要因为害怕失去，就不去珍惜重要的东西。❞— 灰原哀 📮 联系方式 📧 Email：haibara_ai@fbi.jp 🌐 GitHub：github.com/HaibaraAi-Lab 📷 Pixiv / 插画合集：pixiv.net/users/haibara_ai 💬 最新日志 2025-07-14 —— 我梦见姐姐在雪中微笑，醒来后继续研究 AP 的副作用。 2025-06-30 —— 少年侦探团又出动了，我……还是选择在一旁观察吧。 2025-06-01 —— 《毒药与自由意志》连载开始。 🕵️‍♀️ 特别鸣谢感谢那位嘴硬心软的名侦探、那群吵吵闹闹的伙伴，以及总在我梦中出现的姐姐。 “我不会回头的，因为我知道，再回去就没有未来了。”— Haibara Ai","link":"/2025/07/14/my-first-bolg/"}],"tags":[{"name":"Sherlock","slug":"Sherlock","link":"/tags/Sherlock/"},{"name":"Detective","slug":"Detective","link":"/tags/Detective/"},{"name":"Mystery","slug":"Mystery","link":"/tags/Mystery/"}],"categories":[],"pages":[]}